{
"home": {
	"title": "Simple IIIF Discovery",
	"displayName": "Home",
	"class": "discovery-example",
	"file": "../../example-configs/",
	"content": "<h4>Background</h4><p>The Simple IIIF [@@The International Image Interoperability Framework (IIIF) establishes a set of basic structures that facilitate work with images from different collections in a digital workspace. These basic structures allow for the development of a wide variety of tools, services, and viewers, all of which can work with content from any institution that presents its images and data in a IIIF compliant manner. For further information, see https://iiif.io.] Discovery system was originally developed to provide a way to access the images that are stored within multiple, distinct databases within the National Gallery, as well as provide a way to check new scientific and photographic images before they are formally accessioned.</p><p>The system works by preforming a simple keyword search across an institutional [endpoint|./end-points], and returning the results in a IIIF compatible viewer. As many institutions provide public access to their endpoints, the system is easily adapted to perform keyword searches across collections outside of those belonging to the National Gallery. Currently the collections of [INSERT COLLECTIONS LIST HERE] are all searchable via this demonstration site for the Simple IIIF Discovery system.<\/p><h4>Quick Start Guide</h4><p>Begin by selecting the institution whose collection you would like to search from the drop-down menu under 'Search in the uppermost menu bar; if you would like to search multiple collections, select [Cross-Collection Search|combined-example].<\/p><ul><li>Enter your search term in the Yellow box in the left hand column of the page.[@@Multiple words are generally processed using an 'AND' search function, while quotes can be used to help search for phrases. For both of these options exact functionality can vary between collections.]<\/li><li>Underneath the search box, you have the option to specify how many results you would like returned per page. The search will be performed over the entire collection or collections, regardless of the number you select in this field. The choice here only influences how the results will be displayed.<\/li><li>Finally in the Yellow box, you have the choice of which viewer you would like the results displayed in. In OpenSeadragon you'll be able to see the results as thumbnail images. In Mirador, they will be displayed as a list.<\/li><li>Click on 'Search' in the upper left corner of the Yellow Box to perform your search and have the results displayed in the viewer of your choice.<\/li></ul><p>For help navigating the results page see [here|./results], and for more help with viewers see [here|./viewers].</p>",
	"content right": ""
	},
"home-old": {
	"title": "Simple IIIF Discovery",
	"parent": "donotdisplay",
	"content": "<p>This site demonstrates generic public examples of a Simple [IIIF|https:\/\/iiif.io] Discovery system, based on tools used within the National Gallery to provide access to images from multiple departments and present them together in [IIIF compatible viewers|https:\/\/iiif.io\/apps-demos\/].<\/p>\r\n\r\n<h4>Live Examples<\/h4>\r\n\r\n<p>A series of example end-points and search pages have been provided to demonstrate live Simple IIIF Discovery implementations. The examples are ordered by institution and then IIIF viewer; the [Mirador|https:\/\/projectmirador.org\/] based examples demonstrates calls for IIIF Manifests and the [OpenSeadragon or OSD|https:\/\/openseadragon.github.io\/] based examples demonstrates calls for IIIF info.json files.<\/p>\r\n\r\n<div style=\"text-align:center;\">\r\n\t<a class=\"btn btn-outline-primary nav-button\" style=\"margin-bottom:10px;\" id=\"all-examples\" role=\"button\" href=\".\/examples\">All Examples<\/a>\r\n\t<a class=\"btn btn-outline-primary nav-button\"  style=\"margin-bottom:10px;\" id=\"flowers-example\" role=\"button\" href=\".\/viewer-combined-osd\/flowers\">Search: \"flowers\"<\/a>\r\n<\/div>\r\n\r\n<h4>Background<\/h4>\r\n<p>Within the National Gallery similar tools are used to provide access to a wide range of images held in different databases. A version of this Simple IIIF Discovery system is also used to provide a much simpler access to images, before they are entered into any of the databases, through a simple filename based search option, which is used to allow new images to be checked and signed off before they are fully processed and registered as assets.<\/p>\r\n\r\n<p>For general feedback and suggestions please use the \"Feedback\" option on the right. For other inquiries about this work, please submit issues and questions via the [Simple Site GitHub page|https:\/\/github.com\/jpadfield\/simple-site].<\/p>",
	"content right": ""
	},
"search": {
	"title": "Simple IIIF Discovery - <b>Search</b>",
	"displayName": "Search",
	"class": "discovery-example",
	"file": "../../example-configs/",
	"autochildren": 1,
	"content": "<p>Simple IIIF Discovery services utilise existing institutional APIs or stand alone as an independent layers in order to facilitate basic keyword searches over existing datasets. The examples in this section illustrate the implementation of Simple Discovery endpoints in conjunction with the collections of major institutions within the UK. In the case of the [National Gallery|https://www.nationalgallery.org.uk/], the Simple Discovery endpoint utilises [ElasticSearch|https://www.elastic.co/enterprise-search] to preform a basic keyword search on the file names and stored metadata held within the gallery systems, for the [National Gallery of Art|https://nga.gov] example the system carries out a simple keyword search against their website API, while the examples from the [V&A|https://www.vam.ac.uk/] and [Wellcome|https://wellcomecollection.org/] collections make use of the [V&A API (version 2)|https://developers.vam.ac.uk/guide/v2/quick-start.html#quick-start-top], and the [Wellcome’s APIs|https://developers.wellcomecollection.org/catalogue] respectively. Links to the participating institutions are provided below, with search results displayed via Mirador or OpenSeadragon.</p> <p>Should you wish to implement this system at your institution, or have your institution’s Simple IIIF Discovery implementation featured on this site, please use the contact information found under the [About|about] page.</p><div style=\"text-align:center;\">\r\n\t<a class=\"btn btn-outline-primary nav-button\"  style=\"margin-bottom:10px;\" id=\"flowers-example\" role=\"button\" href=\".\/viewer-combined\/flowers\">Example Cross-Collection Search: \"flowers\"<\/a>\r\n<\/div>",
	"content right": "",
	"fluid": 0,
	"displaycode": false	
	},
"examples": {
	"title": "Simple IIIF Discovery - <b>Examples</b>",
	"displayName": "Examples",
	"parent": "searchd",
	"content": "<p>Simple IIIF Discovery services utilise existing institutional APIs or stand alone as an independent layers in order to facilitate basic keyword searches over existing datasets. The examples in this section illustrate the implementation of Simple Discovery endpoints in conjunction with the collections of major institutions within the UK. In the case of the [National Gallery|https://www.nationalgallery.org.uk/], the Simple Discovery endpoint utilises [ElasticSearch|https://www.elastic.co/enterprise-search] to preform a basic keyword search on the file names and stored metadata held within the gallery systems, for the [National Gallery of Art|https://nga.gov] example the system carries out a simple keyword search against their website API, while the examples from the [V&A|https://www.vam.ac.uk/] and [Wellcome|https://wellcomecollection.org/] collections make use of the [V&A API (version 2)|https://developers.vam.ac.uk/guide/v2/quick-start.html#quick-start-top], and the [Wellcome’s APIs|https://developers.wellcomecollection.org/catalogue] respectively. Links to the participating institutions are provided below, with search results displayed via Mirador or OpenSeadragon.</p> <p>Should you wish to implement this system at your institution, or have your institution’s Simple IIIF Discovery implementation featured on this site, please use the contact information found under the [About|about] page.</p>",
	"content right": "",
	"fluid": 0,
	"displaycode": false	
	},
"documentation": {
	"title": "Simple IIIF Discovery - <b>Technical Details and Documentation</b>",
	"displayName": "Documentation",
	"content": "<h4>Summary<\/h4>\r\n<p>The system is based on a website requesting the details of IIIF images from a Simple IIIF Discovery end-point, based on a simple keyword search. The website does not need to understand the complexities of any underlying APIs, just the simple structure of the results returned by the end-point. The website then just needs to be able to reformat the IIIF results and feed them into a IIIF based viewer of choice.<\/p>\r\n\r\n<figure class=\"figure\">\r\n  <a href=\"graphics\/useexample.svg\"><img style=\"\" src=\"graphics\/useexample.svg\" class=\"figure-img img-fluid rounded\" alt=\"Simple IIIF Discovery - Use Flow Diagram\"><\/a>\r\n  <figcaption class=\"figure-caption\">This flow diagram demonstrates the the basic relations of how a website calls data from an example Simple IIIF Discovery end-point - For a live editable version of the diagram see [HERE|https:\/\/research.ng-london.org.uk\/modelling\/?data=eJyFU8tu2zAQPMtA%2FmHhUwLk8Q0J%2BoABHwrHbc9rcmXRIbksuYoiwB%2FfpRzVLZoggAFb9MzszCx1d%2Fc1Y%2Bpg%2BwA3IJ0roB%2BMwEkcR%2FRQEhmn34ZDoCiKQYFMv3oqUirtcssJHliEwxVwBoT1Bi7X1Aps3L6TK2g9D2Ad7jOGaxUgsNRi76XOWm%2BaprlY%2FKRdcUKNi8b3lkrzKBgtZgur1eoL%2FHA0UC5N8mjoyLsDGTmTnmgcWKGFMJuueXQheToRP7li%2BJnyCJ%2BjvUnsojRHzRn3F4uPcNxL6qU0a1ejcntCbqhwn41a%2FOPjI6EOC0RWo8ttbVjGRFWOZoCW23sLO9LySs0N6DkSlLEIhVqqmzGHvsgENKIZQIWVUse71pGFAceqjEb9lQkQgV7Uf%2F0dOFPdo3p9gftvq9vlxeK9bKjQlLnKqGxftRr9V5dWoOUcUIRyc1QbnN9XOQefuYEELQpOCfcwOOk0gVf%2B1Ig%2BUj6pBIyupXqu8WPLt4fCEb5v1kVt%2F2%2BlJbJFL%2BbpXPjtC%2FQW82zy%2FlSlFm%2ByS1o5Jtz5aVeCT7XCenm1FtsbbcX%2FkzrPqaEuMNPrgFdWUEvT3qxVpnVZL44fNZge647wGZ2fZv3l9nruQw0mzFND1YDJhPXtnJ%2BH02tQi5pWbMeIwRn0OqAW7OI0wivNjuAZq4WEe1r%2BBgpGZuQ%3D]<\/figcaption>\r\n<\/figure>\r\n\r\n<p>For general feedback and suggestions please use the \"Feedback\" option on the right. For other inquiries about this work, please submit issues and questions via the [Simple IIIF Discovery GitHub page|https://github.com/jpadfield/iiif-discovery/issues].<\/p>",
	"content right": "",
	"fluid": 0,
	"displaycode": false	
	},
"viewers": {
	"title": "Simple IIIF Discovery - <b>Viewers</b>",
	"displayName": "Viewers",
	"parent": "documentation",
	"content": "<h4>OpenSeadragon</h4><p>In OpenSeadragon (OSD) the results of the search will appear as a series of thumbnail images. Zoom functionality is provided by double clicking on the area that you would like to see in greater detail, and one can more through the viewing pane by clicking and dragging. The controls in the upper left corner of the viewing window can also be used to zoom, pan, and return to the thumbnail view by clicking on the 'home' icon. Clicking the last icon will display the results in full-screen.</p><figure class=\"figure\">\r\n<img style=\"\" src=\"graphics\/OpenSeadragon-example.png\" class=\"figure-img img-fluid rounded\" alt=\"Annotated Openseadragon screenshot\">\r\n<\/figure><h4>Mirador</h4><p>In Mirador, the results are returned as a list. To see an image in the viewing window, click on the item in the list. To add an additional item to the viewer, click on the 'plus' icon in the upper left and select the item you'd like to see. This action can be repeated to add multiple items to the viewing window.</p><p>Along the left-hand side of the viewer, the user can customise the display of their selected images:</p><ul><li>The clicking on the 'dual bookmark' icon displays a list of which images have been opened using the 'plus' icon discussed above.</li><li>The 'cog' icon allows the user to change the language and theme of the viewer.</li><li>The 'three dots' icon gives the user the option to export their workspace[@@A workspace is the term to define the both the list of results available under the 'aplus' icon, as well as the arrangement of the images in the viewing window. This function can facilitate collaborative work on a set of images or objects.], a function which result in a string of code which can be imported into any Mirador viewer using the 'import workspace' function.</li><li>Clicking on the 'incomplete square' icon at the bottom allows the user to see the viewer in full-screen.</li></ul><p>Selecting the three horizontal bars next to the title of each object in the viewing window will result in a side bar which presents the metadata associated with object, as well as provide licencing information by selecting the '©' icon from the left-had menu in each item window.</p><figure class=\"figure\">\r\n<img style=\"\" src=\"graphics\/Mirador-functionality-screenshot.png\" class=\"figure-img img-fluid rounded\" alt=\"Annotated Openseadragon screenshot\">\r\n<\/figure>",
	"content right": "",
	"fluid": 0,
	"displaycode": false	
	},
"results": {
	"title": "Simple IIIF Discovery - <b>Results</b>",
	"displayName": "Explaining the Results",
	"parent": "documentation",
	"content": "<p>Regardless of which viewer you choose, the top of the results page will have a Yellow Bar displaying your search term and the number of results that are currently being displayed along with the total number of results returned.</p><figure class=\"figure\">\r\n<img style=\"\" src=\"graphics\/OpenSeadragon-results-bar.png\" class=\"figure-img img-fluid rounded\" alt=\"Annotated Openseadragon results menu bar screenshot\"><figcaption class=\"figure-caption\">The results menu bar for the screen displaying the OpenSradragom IIIF Viewer<\/figcaption>\r\n<\/figure><figure class=\"figure\">\r\n<img style=\"\" src=\"graphics\/Mirador-results-bar.png\" class=\"figure-img img-fluid rounded\" alt=\"Annotated Mirador results menu bar screenshot\"><figcaption class=\"figure-caption\">The results menu bar for the screen displaying the Mirador IIIF Viewer<\/figcaption>\r\n<\/figure><p>On the right-hand side of the yellow bar, a series of blue buttons provide links to further information about the results that have been returned.</p><ul><li>The 'i' icon provides information about the results of the search.</li><li>The viewer can be changed to Mirador by clicking the 'M' icon when viewing results in OpenSeadragon, and to OpenSeadragon by clicking the 'overlapping squares' icon from Mirador.</li><li>The 'magnifying glass' icon provides the ability to run a new search, to display more results per page, and to change to a different viewer.</li><li>In the OpenSeadragon viewer, the 'list' icon provides the filename and thumbnail of each displayed item as well as a link to the IIIF info file for that item.[@@IIIF info files provide information about individual image files, and are distinct from IIIF manifests, which can be used to move the item into different IIIF viewers. For more information about creating and using IIIF manifests see https://iiif-io.medium.com/how-to-use-iiif-resources-and-image-viewers-bd378a68b013.] Clicking on the thumbnail of the image in this list will open that image alone in OpenSeadragon.</li><li>Underneath the blue buttons there is the option to see multiple pages of results. Changing the number of results displayed per page using the 'magnifying glass' icon will result in updating the total number of pages.[@@When using the Mirador viewer to view multiple items, the items you wish to view together must be on the same page of the results. If they are not, see the demonstration at https://www.youtube.com/watch?v=0KEiGkkNVnM&t=41s to see how to load additional manifests into the results.]</li></ul><div class=\"alert alert-info\" role=\"alert\"><h5>Please note:</h5><ul><li>Searches look for matching objects, rather than directly for matching images, so the exact number of IIIF images displayed may be different from the number of object discovered.</li><li>The search term used can be matched against any text resources or fields linked to an object, rather than just keywords and titles, etc. so the exact source of the match may not always be clear in the viewers.</li></ul></div>",
	"content right": "",
	"fluid": 0,
	"displaycode": false	
	},
"end-points": {
	"title": "Simple IIIF Discovery - <b>End-Points</b>",
	"displayName": "End-Points",	
	"parent": "documentation",
	"class": "discovery-example",
	"file": "../../example-configs/",
	"content": "<p>A growing number of institutions are beginning to provide linked open data APIs or direct search portals that allow external users to explore their public digital resources. These can offer a wide range of options and can be used as the basis of new collection presentations or even cross collection search options. However, even when they are well documented, it can still take quite a bit of technical knowledge to fully exploit their potential and it can take some time to learn how local data structures or even international standards have been used before specific resources, such as IIIF manifests, can be found. The propose of the Simple IIIF Discovery system is to provide a structure through which simpler more direct access can be provided to IIIF resources.</p><div class=\"alert alert-info\" role=\"alert\"><p style=\"margin-bottom:0px;\">This end-point definition is relatively simple, it is meant to be. It could be seen as an <b>entry level</b> or <b>level 0</b> form of IIIF discovery. It is envisaged that more complex end-points could be produced in the future providing more complex search options in relation to more standardised data presentations.<\/p><\/div><p>A Simple IIIF Discovery End-point is a small website or service that is designed to process simple text based queries and return formatted IIIF resources. They need to be able to process a simple GET request using a defined set of variables, carry out a predefined search for either IIIF manifests or info.json files and then reformat the search results to provide a simple defined set of JSON results that can then be used to display the IIIF resources that have been discovered. Once and end-point has been setup to talk to a given institutions API then far less technical savvy users can use systems like Simple Site to create their own IIIF presentations.</p><h4>End-Point request URL format</h4><p>Further description of the four possible GET variables can be found in the <a href=\".\/diagram\">model diagram</a>.</p><div class=\"alert alert-light border border-dark\" role=\"alert\"><p style=\"margin-bottom:0px;text-align: center;\">https://api-url/?<b>search</b>=TERMs&<b>limit</b>=INT&<b>from</b>=INT<\/p><\/div>",
	"content right": "<h4>Example PHP End-point script</h4><p>Simple IIIF Discovery end-points could be created using a range of programming languages, this simplified version on PHP is just included to provide and example of the processes required.</p><figure>\r\n\t\t<pre style=\"overflow: auto;max-height:400px;border: 2px solid black;padding: 10px;\">\r\n<code  class=\"language-php hjls\">&lt;?php\r\n\r\n$results = array();\r\n\r\nif (!isset($_GET[&quot;limit&quot;])) {$_GET[&quot;limit&quot;] = 25;}\r\nif ($_GET[&quot;limit&quot;] &gt; 100) {$_GET[&quot;limit&quot;] = 100;}\r\nif (!isset($_GET[&quot;from&quot;])) {$_GET[&quot;from&quot;] = 0;}\r\nif (!isset($_GET[&quot;search&quot;])) {$_GET[&quot;search&quot;] = false;}\r\nif (!isset($_GET[&quot;tag&quot;])) {$_GET[&quot;tag&quot;] = &quot;ng&quot;;}\r\n\r\n$configPath = &quot;\/var\/www\/www-discovery\/iiif\/configs\/&quot;;\r\n\/\/ Get details of the APIs and data organisation for a given end-point\r\n$config = getConfig ($_GET[&quot;tag&quot;]); \r\n\r\nif ($_GET[&quot;search&quot;])\r\n\t{\r\n\t$cResults = getObjectIIIF ($_GET[&quot;search&quot;], intval($_GET[&quot;limit&quot;]), intval($_GET[&quot;from&quot;]));\r\n\r\n\t$out = array(\t\t\r\n\t\t&quot;limit&quot; =&gt; $cResults[1],\r\n\t\t&quot;from&quot; =&gt; $cResults[2], \r\n\t\t&quot;limited&quot; =&gt; $cResults[3],\r\n\t\t&quot;total&quot; =&gt; $cResults[4],\r\n\t\t&quot;search&quot; =&gt; $_GET[&quot;search&quot;],\r\n\t\t&quot;results&quot; =&gt; $cResults[0],\r\n\t\t&quot;comment&quot; =&gt; $cResults[5],\r\n\t\t&quot;altIDs&quot; =&gt; $cResults[6]\r\n\t\t);\r\n\t}\r\nelse\r\n\t{\r\n\t$out = array(\t\t\r\n\t\t&quot;limit&quot; =&gt; 25,\r\n\t\t&quot;from&quot; =&gt; 0, \r\n\t\t&quot;limited&quot; =&gt; false,\r\n\t\t&quot;total&quot; =&gt; false,\r\n\t\t&quot;search&quot; =&gt; &quot;required-search-term&quot;,\r\n\t\t&quot;results&quot; =&gt; array(&quot;info&quot;=&gt;array(), &quot;manifests&quot;=&gt;array()),\r\n\t\t&quot;comment&quot; =&gt; &quot;This API has been setup to return lists of IIIF manifests or info.json URLs based on a simple keyword search passed via the URL. Available variable include: \\&quot;search\\&quot; (the keyword of interest), \\&quot;limit\\&quot; (a simple limit on the total number of manifest to be returned, up to a maximum of 100, default 25), \\&quot;from\\&quot; (an offset value to facilitate pagination of results in conjunction with a defined \\&quot;limit\\&quot; value, default = 0) and \\&quot;what\\&quot; (determining what should be returned, either IIIF manifests or info.json files, valid options are 'manifests' or 'info', default = 'manifests'.&quot;,\r\n\t\t&quot;altIDs&quot; =&gt; array()\r\n\t\t);\r\n\t}\r\n\r\n$json = json_encode($out);\r\nheader('Content-Type: application\/json');\r\nheader(&quot;Access-Control-Allow-Origin: *&quot;);\r\necho $json;\r\nexit;\t\r\n\r\nfunction getObjectIIIF ($str, $limit=25, $start=0)\r\n\t{\r\n\tglobal $config;\t\t\t\t\t\r\n\t\t\t\t\t\r\n\t$limited = false;\t\r\n\t$missed = 0;\r\n\t$out = array(&quot;info&quot; =&gt; array(), &quot;manifests&quot; =&gt; array());\r\n\t\r\n\t\/\/ These are used to help individual image searches from the image list on the openseadragon viewer pages.\r\n\t$altIDs = array();\r\n\t$str = urlencode($str);\r\n\t\r\n\t\/\/ Some APIs work on a simple count of the number objects to start searching from, but other work in page numbers\r\n\tif (isset($config[&quot;page&quot;]) and $config[&quot;page&quot;])\r\n\t\t{$start = floor($start\/$limit) + 1;}\r\n\t\r\n\t\/\/ Default option that both IIIF manifests and info.json files will be returned from the same query.\t\r\n\tif (isset($config[&quot;api&quot;]) and $config[&quot;api&quot;])\r\n\t\t{\r\n\t\t$uri = $config[&quot;api&quot;][0].$start.$config[&quot;api&quot;][1].$limit.$config[&quot;api&quot;][2].$str;\r\n\t\t$arr = getsslJSONfile($uri, true, true); \/\/ Function to call JSON data from a given endpoint\r\n\r\n\t\t\/\/ Function that can extract fields of groups of fields from the returned data\r\n\t\t$total = getNestedValue ($arr, $config[&quot;total&quot;]);\r\n\t\tif (!$total) {$total = 0;}\r\n\t\tif ($total &gt; $limit) {$limited = true;}\r\n\t\r\n\t\t\/\/ Function get data identified by field names\r\n\t\t$results = getResults ($arr, $config[&quot;results&quot;]);\r\n\t\r\n\t\t\/\/ Organise the results into the simple lists required.\r\n\t\t$mdets = formatResults ($results, $config[&quot;manifests&quot;]);\r\n\t\t$out[&quot;manifests&quot;] = array_merge($out[&quot;manifests&quot;], $mdets[0]);\r\n\t\t$altIDs = array_merge($altIDs, $mdets[1]);\r\n\r\n\t\t$idets = formatResults ($results, $config[&quot;info&quot;]);\r\n\t\t$out[&quot;info&quot;] = array_merge($out[&quot;info&quot;], $idets[0]);\r\n\t\t$altIDs = array_merge($altIDs, $idets[1]);\r\n\t\t}\r\n\t\r\n\t\/\/ If separate calls are needed for the the IIIF manifest and info.json files\r\n\t\/\/ they can be processed individually\t\r\n\tif (\r\n\t\tisset($config[&quot;info&quot;][&quot;api&quot;]) and isset($config[&quot;info&quot;][&quot;results&quot;]) and \r\n\t\tisset($config[&quot;info&quot;][&quot;total&quot;]) and $config[&quot;info&quot;][&quot;api&quot;] and \r\n\t\t$config[&quot;info&quot;][&quot;results&quot;] and $config[&quot;info&quot;][&quot;total&quot;])\r\n\t\t{\t\t\r\n\t\t$uri = $config[&quot;info&quot;][&quot;api&quot;][0].$start.$config[&quot;info&quot;][&quot;api&quot;][1].$limit.$config[&quot;info&quot;][&quot;api&quot;][2].$str;\r\n\t\t$arr = getsslJSONfile($uri);\r\n\r\n\t\t$total = getNestedValue ($arr, $config[&quot;info&quot;][&quot;total&quot;]);\r\n\t\tif (!$total) {$total = 0;}\r\n\t\tif ($total &gt; $limit) {$limited = true;}\r\n\t\r\n\t\t$results = getResults ($arr, $config[&quot;info&quot;][&quot;results&quot;]);\r\n\t\t$idets = formatResults ($results, $config[&quot;info&quot;]);\r\n\t\t$out[&quot;info&quot;] = array_merge($out[&quot;info&quot;], $idets[0]);\r\n\t\t$altIDs = array_merge($altIDs, $idets[1]);\t\r\n\t\t}\r\n\r\n\t\t\/\/ If separate calls are needed for the the IIIF manifest and info.json files\r\n\t\/\/ they can be processed individually\t\r\n\tif (\r\n\t\tisset($config[&quot;manifests&quot;][&quot;api&quot;]) and isset($config[&quot;manifests&quot;][&quot;results&quot;]) and \r\n\t\tisset($config[&quot;manifests&quot;][&quot;total&quot;]) and $config[&quot;manifests&quot;][&quot;api&quot;] and \r\n\t\t$config[&quot;manifests&quot;][&quot;results&quot;] and $config[&quot;manifests&quot;][&quot;total&quot;])\r\n\t\t{\r\n\t\t$uri = $config[&quot;manifests&quot;][&quot;api&quot;][0].$start.$config[&quot;manifests&quot;][&quot;api&quot;][1].$limit.$config[&quot;manifests&quot;][&quot;api&quot;][2].$str;\r\n\t\t$arr = getsslJSONfile($uri);\r\n\t\t\r\n\t\t$mtotal = getNestedValue ($arr, $config[&quot;manifests&quot;][&quot;total&quot;]);\r\n\t\tif (!$mtotal) {$mtotal = 0;}\r\n\t\t\/\/ Need to extend system to cope with different totals.\r\n\t\tif ($mtotal &gt; $total) {$total = $mtotal;}\r\n\t\tif ($total &gt; $limit)\r\n\t\t\t{$limited = true;}\r\n\r\n\t\t$results = getResults ($arr, $config[&quot;manifests&quot;][&quot;results&quot;]);\t\t\t\t\r\n\t\t$mdets = formatResults ($results, $config[&quot;manifests&quot;]);\r\n\t\t$out[&quot;manifests&quot;] = array_merge($out[&quot;manifests&quot;], $mdets[0]);\r\n\t\t$altIDs = array_merge($altIDs, $mdets[1]);\r\n\t\t}\r\n\r\n\tif (isset($config[&quot;page&quot;]) and $config[&quot;page&quot;])\r\n\t\t{$start = intval(($start - 1) * $limit);\t}\r\n\t\t\r\n\t$comment = &quot;IIIF resources returned from a full-text object search, for &lt;b&gt;$str&lt;\/b&gt; of the $config[str].&quot;;\r\n\t\r\n\treturn (array($out, $limit, $start, $limited, $total, $comment, $altIDs));\r\n\t}\r\n\t\r\n?&gt;</code></pre><figcaption class=\"figure-caption\">A simplified example of a PHP based end-point.</figcaption>\r\n</figure><h4>Example JSON End-point configuration file</h4><p>The current example end-points and example search pages, host by the National Gallery, are all automatically generated using a JSON configuration file. An example with some explanations is provided here. To add a new collection to this system one would just need to provide a completed template.</p><figure>\r\n\t\t<pre class=\"json-renderer\" style=\"overflow: auto;max-height:400px;border: 2px solid black;padding: 10px;\">\r\n<code  class=\"language-php hjls\">{\r\n\t\"tag\": \"Short (2-4) str identifying a given collection\",\r\n\t\"name\": \"The display name for a given collection\",\r\n\t\"logo\": \"A link to an appropriate logo at least fitting within a 150x150px box \",\r\n\t\"link\": \"Institution website link\",\r\n\t\"docURL\": \"Link to the documentation related to the API that is being used\",\r\n\t\"termsURL\": \"Link to the licence or terms of use for the data & images pulled from the API\",\r\n\t\"comment\": \"Short description of a given collection up to about 100 words.\",\r\n\t\"examples\": [\r\n\t\t\"A short list\",\r\n\t\t\"of about 4 or 5\",\r\n\t\t\"example info.json urls\",\r\n\t\t\"to be displayed on the example landing page\"],\r\n\t\"str\": \"A simple string to indicate were the data it from: it will be slotted into existing text ending with \\\"the\\\", also please omit a final full-stop as this will also be added automatically.\",\r\n\t\"total\": [\"An array of\", \"field names\", \"that lead to the\", \"total number of hits\"],\r\n\t\"results\": [[\"An\", \"array\", \"of\"], [\"arrays\", \"of\", \"field\", \"names\"], [\"that\", \"lead\", \"to\", \"results\"]],\r\n\t\"page\": \"Boolean true\/false value - does the API orgniase the results by page number or a simple start number\",\r\n\t\"api\": [\"https:\/\/API-SEARCH-URI?page=\", \"&limit=\", \"&anyadditionalvariablestocontrolthesearch&SEARCHVARIABLE=\"],\r\n\t\"info\": {\r\n\t\t\"total\": \"Optional \\\"info\\\" specific value - structure the same field type as above\",\t\r\n\t\t\"api\":  \"Optional \\\"info\\\" specific value - structure the same field type as above\",\r\n\t\t\"results\":  \"Optional \\\"info\\\" specific value - structure the same field type as above\",\r\n\t\t\"regex\": \"OPTIONAL REGULAR EXPRESSION STRING TO APPLY TO THE VALUE - such as:(.+[\\\\\\\/])full[\\\\\\\/].+default.jpg\",\r\n\t\t\"regexNo\": \"OPTIONAL LIST OF INDEXES TO CONTROL WHICH REGEX MATCHES TO CONCATENATE - such as [1]\",\r\n\t\t\"valueConditionField\": \"OPTIONAL CONDITION FIELD WHEN TO ALLOW SOME RESULTS TO BE SKIPPED - such as [\\\"locationType\\\", \\\"id\\\"]\",\r\n\t\t\"valueConditionValue\": \"OPTIONAL VALUE FOR THE CONDITION FIELD TO MATCH - such as iiif-presentation\",\r\n\t\t\"value\": [\"An array of\", \"field names\", \"that lead to the\", \"value\"],\t\t\r\n\t\t\"url\": \"Optional URL prefix used to build the info.json url\",\r\n\t\t\"suffix\": \"\/info.json (or simpler optional suffix to complete the URL)\",\r\n\t\t\"altID\": [\"Optional field name used to help the searching for individual images\"]\r\n\t},\r\n\t\"manifests\": {\r\n\t\t\"total\": \"Optional \\\"manifest\\\" specific value - structure the same field type as above\",\t\r\n\t\t\"api\":  \"Optional \\\"manifest\\\" specific value - structure the same field type as above\",\r\n\t\t\"results\":  \"Optional \\\"manifest\\\" specific value - structure the same field type as above\",\r\n\t\t\"regex\": \"OPTIONAL REGULAR EXPRESSION STRING TO APPLY TO THE VALUE - such as:(.+[\\\\\\\/])content[\\\\\\\/]ngaweb[\\\\\\\/](.+)\",\r\n\t\t\"regexNo\": \"OPTIONAL LIST OF INDEXES TO CONTROL WHICH REGEX MATCHES TO CONCATENATE - such as [1, 2]\",\r\n\t\t\"valueConditionField\": \"OPTIONAL CONDITION FIELD WHEN TO ALLOW SOME RESULTS TO BE SKIPPED - such as [\\\"locationType\\\", \\\"id\\\"]\",\r\n\t\t\"valueConditionValue\": \"OPTIONAL VALUE FOR THE CONDITION FIELD TO MATCH - such as iiif-presentation\",\r\n\t\t\"value\": [\"An array of\", \"field names\", \"that lead to the\", \"value\"],\r\n\t\t\"url\": \"Optional URL prefix used to build the IIIF manifest url\",\r\n\t\t\"suffix\": \"\/manifest.json  (or simpler suffix to complete the URL)\"\r\n\t}\r\n}</code></pre><figcaption class=\"figure-caption\">A commented example of a JSON, end-point, configuration file.</figcaption>\r\n</figure>",
	"fluid": 0,
	"displaycode": false	
	},
"diagram": {
	"title": "Simple IIIF Discovery - <b>Model Diagram</b>",
	"displayName": "Model Diagram",
	"parent": "documentation",
	"content": "<p>This flow diagram highlights the main details of this Simple IIIF Discovery System. Search and control variables are passed via a standard URI, where the search term is a simple alphanumeric string. This simple discovery system does not need to define or require any specific data structure, ontologies or programming language for a given API, it only requires that it can process the defined input variables and is able to return either lists of IIIF manifests or info.json URLs in a structured JSON document as indicated. As noted in the diagram the complexity of the system could be increased to facilitate more complex boolean (AND\/OR\/NOT) term combinations, but this is not required at this time.</p><figure class=\"figure\">\r\n  <img style=\"\" src=\"graphics\/newdiscovery.svg\" class=\"figure-img img-fluid rounded\" alt=\"Simple IIIF Discovery - System Model Flow Diagram\">\r\n  <figcaption class=\"figure-caption\">This model diagram was created using the [Simple Dynamic Modelling|https://github.com/jpadfield/dynamic-modelling] system, a editable version of the diagram can be seen [HERE|https://research.ng-london.org.uk/modelling/?data=eJzlVsGO2zgMPTtA%2FoFALy2Q2WD3D6bItshiMF1kpnunbTrWjCx5JTppgPn4pSTLSZq0OfS4wACxPeQj%2BfhIabn87LBv4WEDd8Ct8iB%2FaMD2rKxBDb6nSslvZbuODIsNMjj6dyDPHp4%2Fwvtn28NHy2y7D2AdYMB6%2F0ANw0ZtW%2F4AjbZ7qBVuHXYLASCoqcFBc4j1sCmKYj5bLv1QbmMqj7SHJ9X1mmC9Xn%2BClfKV3ZE7wNPBM3Xz2Ya8eHtorOuQmZwvevSePNTICGyLJ0ZTo6sTwj%2BK9mL07u6PAiu27s2WL1TxVaAWPRjLVHyavsHeDrqGksCntLZkyKkKekWVBLWNsFOTxAXGV4oVuhFZ0oCQW%2FhoQBmxQdiqnbzsYlaZ9irHqK0hwOggnlsKJJWDErb2AWLwymzB247ETZ60koh92y8C94qPOJ11AnYw2KkKtT6Mni%2B4Q1851XPxFuqcz%2Bazq2wXCQm1t6FfSrKSCDUF55KKK9TFhN5%2BBJcwRF%2BmH9gX93%2BvYZ0ep3Zcd3TEgzPJY4x6y2Vq4spSfAJDVIcGHSvRqlOc1BhE49kNlQSi0E40h%2Fi1RE%2FCpdQlRIiHeRUUyWMBL4NPzmd%2B4QN9k4lhsUuFRgWE73zoKb4kxrK5yxXlZpxMwooYlfbZ9ISyMDInr2EelSAVntBVbfHmeWiaM5M80EWs%2B6cWjbPdNYPcauHCF183a%2Fj85zPs0CkstcSez8boE%2Ftjc17psLcu0i%2Fjl7Ut3KpYmnAf%2FS4ngXakbZ8aJxKWLdK3DsOcS%2F%2FGWbx%2FXEVWv2zCiiqVwVCFX8jMcMJL0xtEIJhBB1RnthMXU74hrSSL2CehQcrTsukApb%2BDT5lILa%2BwV9yCRifz6YljHWMnF9F5LBRHPGtizWboShn5ozEkcVNUxbQZwrxGFNGdDC9TGH1HafdeYvg2VugZHaesHWmhYZdWUtCeZVnhF56Zhtjw%2Fz0LyyWZOk7WrSHMWyhPYX5XptKDbMg0Y%2B%2Fufj%2BbogurkORNowhF9U27WNxNqzRpN83c92v2qtV4Jfg5FGper%2FxVm7N98tfTl8dI%2FcTdJMh76VQVFsjYAlHVII2Mokx6VElYefsdVf1LOGMuifwTlNJaTXJHSo4irkmgKu%2F0Uc6XKg0wJYm6R%2Bic7NS%2BKc7zFcX21nsly3aCi7MwLcyrY3ROylEAv0qv%2B77TyjR26vPFfzs0qgl3xskk2p9kMS50rXw8HOORHmx%2Be%2FGyOL5uHqZJzVi3vLPdmXNW7Ykv0zcebzbxDAzHS77vxiWSVt7Jcb1I9%2BJGLoHhbJLrQiJb5J3jjMI%2Fhjm5VE9Zrvy0UFvS%2FQnN4a4W2hi0tVN16Ijq5Dp4ZV0dn%2F4D8MsagA%3D%3D]<\/figcaption>\r\n<\/figure><p>For general feedback and suggestions please use the \"Feedback\" option on the right. For other inquiries about this work, please submit issues and questions via the [Simple IIIF Discovery GitHub page|https://github.com/jpadfield/iiif-discovery/issues].<\/p>",
	"content right": ""
	},
"about": {
	"title": "Simple IIIF Discovery - <b>About</b>",
	"content": "<div class=\"alert alert-info\" role=\"alert\"><h4>Simple Site Collaborations<\/h4><p>The Simple IIIF Discovery systems is built on several extensions of the Simple Site project, developed out of work from a number of different projects, all of which involved some aspect of making image search and presentation more FAIR. The work is intended to demonstrate how shared international standards, like IIIF, can be used to facilitate simple cross collection interoperability. <b>Basically, making it easier for users to find and explore the rich image content being presented on the web.</b> This work will continue across these and future projects and further collaborations are anticipated.<\/p><\/div>\r\n\r\n<h3>For Developers:<\/h3> \r\n\r\n<p>We welcome collaboration from institutions and individuals interested in adapting Simple IIIF Discovery to respond to their needs. As a starting point, the code provided can be adapted to your institutional infrastructure as may be necessary. For general enquires, please submit issues and questions via the <a href=\"https://github.com/jpadfield/iiif-discovery/issues\">Simple IIIF Discovery</a> GitHub page.<\/p>\r\n\r\n<h3>For Researchers:<\/h3>\r\n\r\n<p>Simple IIIF Discovery is intended as a means exploring and surveying the collections of participating institutions. As the results of the search are determined by information provided in the data structure of each institution, the information returned from a search may not be exhaustive nor representative of the entirety of an institution's holdings; however, Simple IIIF Discovery may serve as a starting point for initial enquiries into the collections held by the participating institutions.<\/p>  \r\n\r\n<p>Please note that copyright and reproduction permissions are maintained by each participating institution for their own objects, and rights must be obtained in accordance with the conditions imposed by those institutions. Information about a given holding institution, when executing a combined search, will be available in returned IIIF manifests or via the links provided when working with simple IIIF info.json files. \r\n\r\n<h3>Acknowledgement<\/h3>\r\n\r\n<p>This development of the Simple IIIF Discovery project has been directly supported by the following projects:<\/p>\r\n<br\/>\r\n<h4>Practical applications of IIIF Project<\/h4>\r\n<figure class=\"figure\">\r\n  <img style=\"height:64px;\" src=\"graphics\/TANC - IIIF.png\" class=\"figure-img img-fluid rounded\" alt=\"IIIF - TANC\">\r\n  <figcaption class=\"figure-caption\">AHRC funded - IIIF-TNC | Practical applications of IIIF as a building block towards a digital National Collection -   [IIIF - TNC|https:\/\/tanc-ahrc.github.io\/IIIF-TNC]<\/figcaption>\r\n<\/figure>\r\n\r\n<h4>SSHOC (H2020)<\/h4>\r\n<figure class=\"figure\">\t\r\n  <img style=\"height:64px;\" src=\"graphics\/sshoc-logo.png\" class=\"figure-img img-fluid rounded\" alt=\"The SSHOC Project\">\r\n  <img style=\"height:32px;\" src=\"graphics\/sshoc-eu-tag2.png\" class=\"figure-img img-fluid rounded\" alt=\"The SSHOC Project\">\r\n  <figcaption class=\"figure-caption\">Social Sciences & Humanities Open Cloud (SSHOC)is a project funded by the EU framework programme Horizon 2020 and unites [20 partner organisations and their 27 associates|https:\/\/www.sshopencloud.eu\/partners] in developing the social sciences and humanities area of the [European Open Science Cloud (EOSC)|http:\/\/www.eosc-portal.eu\/] - [SSHOC|https:\/\/www.sshopencloud.eu\/]<\/figcaption>\r\n<\/figure>\r\n<br\/>\r\n<h4>IPERION-HS (H2020)<\/h4>\r\n<figure class=\"figure\">\r\n  <img style=\"height:64px;\" src=\"https://raw.githubusercontent.com/jpadfield/simple-modelling/master/docs/graphics/IPERION-HS%20Logo.png\" class=\"figure-img img-fluid rounded\" alt=\"The IPERION-HS Project\">\r\n  <img style=\"height:32px;\" src=\"https://raw.githubusercontent.com/jpadfield/simple-modelling/master/docs/graphics/iperionhs-eu-tag2.png\" class=\"figure-img img-fluid rounded\" alt=\"The IPERION-HS Project\">\r\n<figcaption class=\"figure-caption\">IPERION-HS (H2020) | Integrating Platforms for the European Research Infrastructure ON Heritage Science -   [IPERION-HS|https://www.iperionhs.eu/]<\/figcaption>\r\n<\/figure>\r\n\r\n<p>For general feedback and suggestions please use the \"Feedback\" option on the right. For other inquiries about this work, please submit issues and questions via the [Simple IIIF Discovery GitHub page|https://github.com/jpadfield/iiif-discovery/issues].<\/p>",
	"content right": ""	,
	"displaycode": false		
	}
}
